app/controllers/employees_controller.rb

INSERT INTO "employees" ("name", "employee_type", "user_id", "early_shift", "day_shift", "late_shift", "night_shift", "day_off_requests", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @employee = Employee.new(employee_params.merge(user_id: current_user.id))
    if @employee.save

SELECT "employees".* FROM "employees" WHERE "employees"."user_id" = $1 AND "employees"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
---
  def show
    @employee = current_user.employees.find(params[:id])

SELECT "employees".* FROM "employees" WHERE "employees"."user_id" = $1 AND "employees"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
---
  def edit
    @employee = current_user.employees.find(params[:id])

SELECT "employees".* FROM "employees" WHERE "employees"."user_id" = $1 AND "employees"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
UPDATE "employees" SET "name" = $1, "updated_at" = $2 WHERE "employees"."id" = $3  [["name", "4"], ["updated_at", "2024-09-04 00:03:46.398154"], ["id", 1]]
---
  def update
    @employee = current_user.employees.find(params[:id])
    if @employee.update(employee_params)

SELECT "employees".* FROM "employees" WHERE "employees"."user_id" = $1 AND "employees"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
DELETE FROM "employees" WHERE "employees"."id" = $1  [["id", 1]]
---
  def destroy
    @employee = current_user.employees.find(params[:id])
    @employee.destroy