app/controllers/shifts_controller.rb

SELECT "memos".* FROM "memos" WHERE "memos"."date" BETWEEN $1 AND $2 AND "memos"."user_id" = $3  [["date", "2024-09-01"], ["date", "2024-09-30"], ["user_id", 1]]
---
  def index
    Rails.logger.debug "Calling set_month_data in ShiftsController#index"
    set_month_data(params[:year], params[:month])
    @employees = current_user.employees
    @shifts = Shift.where(employee_id: @employees.pluck(:id)).group_by(&:employee_id)
    @memos = Memo.where(date: @start_date..@end_date, user_id: current_user.id).index_by(&:date)

SELECT "shift_requests".* FROM "shift_requests" WHERE "shift_requests"."date" BETWEEN $1 AND $2 AND "shift_requests"."user_id" = $3  [["date", "2024-09-01"], ["date", "2024-09-30"], ["user_id", 1]]
SELECT "memos".* FROM "memos" WHERE "memos"."date" BETWEEN $1 AND $2 AND "memos"."user_id" = $3  [["date", "2024-09-01"], ["date", "2024-09-30"], ["user_id", 1]]
---
  def new
    @year = params[:year]
    @month = params[:month]

    set_month_data(@year, @month)
    @employees = current_user.employees
    @shift_requests = ShiftRequest.where(date: @start_date..@end_date, user_id: current_user.id).group_by(&:employee_id)
    @memos = Memo.where(date: @start_date..@end_date, user_id: current_user.id).index_by(&:date)

SELECT "memos".* FROM "memos" WHERE "memos"."date" BETWEEN $1 AND $2 AND "memos"."user_id" = $3  [["date", "2024-09-01"], ["date", "2024-09-30"], ["user_id", 1]]
SELECT "shift_requests".* FROM "shift_requests" WHERE "shift_requests"."date" BETWEEN $1 AND $2 AND "shift_requests"."user_id" = $3  [["date", "2024-09-01"], ["date", "2024-09-30"], ["user_id", 1]]
SELECT "employees".* FROM "employees" WHERE "employees"."user_id" = $1  [["user_id", 1]]
---
  def create_schedule
    Rails.logger.debug "Calling set_month_data in ShiftsController#create_schedule"
    set_month_data(params[:year], params[:month])
    @employees = current_user.employees
    @memos = Memo.where(date: @start_date..@end_date, user_id: current_user.id).index_by(&:date)

    employees = current_user.employees
    dates = (@start_date..@end_date).to_a
    shift_requests = ShiftRequest.where(date: @start_date..@end_date, user_id: current_user.id).group_by(&:employee_id)

    data = {
      employees: employees.map do |e|