app/controllers/shift_requests_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."user_id" = $1  [["user_id", 1]]
SELECT "shifts".* FROM "shifts" WHERE "shifts"."user_id" = $1  [["user_id", 1]]
SELECT "shift_requests".* FROM "shift_requests" WHERE "shift_requests"."user_id" = $1 AND "shift_requests"."date" BETWEEN $2 AND $3  [["user_id", 1], ["date", "2024-09-01"], ["date", "2024-09-30"]]
SELECT "memos".* FROM "memos" WHERE "memos"."user_id" = $1 AND "memos"."date" BETWEEN $2 AND $3  [["user_id", 1], ["date", "2024-09-01"], ["date", "2024-09-30"]]
---
  def set_common_data
    year = params[:year] || params.dig(:shift_request, :year)
    month = params[:month] || params.dig(:shift_request, :month)
    set_month_data(year, month)
    Rails.logger.debug "Year: #{year}, Month: #{month}, Start Date: #{@start_date}, End Date: #{@end_date}"

    @employees = current_user.employees
    @shifts = current_user.shifts.group_by(&:employee_id)
    @shift_requests = current_user.shift_requests.where(date: @start_date..@end_date)
    @memos = current_user.memos.where(date: @start_date..@end_date).index_by(&:date)